In [10]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df.job_posted_date)

In [4]:
df.loc[0:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [5]:
#df['salary_year_avg'].median()

# or 

median_salary_yearly = df.salary_year_avg.median()

In [6]:
median_salary_hourly = df.salary_hour_avg.median()

fillna() method - in this we are filling the NA value with median

In [7]:
df_filled = df

df_filled['salary_year_avg']= df_filled['salary_year_avg'].fillna(median_salary_yearly)
df_filled['salary_hour_avg']= df_filled['salary_hour_avg'].fillna(median_salary_hourly)

In [8]:
df_filled.loc[0:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

drop duplicates

In [11]:
df_unique = df

df_unique = df_unique.drop_duplicates()

print ('Length of original df: ', len(df_filled))
print('Length of drop duplicates df:', len(df_unique))
print('Rows Dropped:', len(df_filled)-len(df_unique))

Length of original df:  785741
Length of drop duplicates df: 785640
Rows Dropped: 101

In [12]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])

print ('Length of original df: ', len(df_filled))
print('Length of drop duplicates df:', len(df_unique))
print('Rows Dropped:', len(df_filled)-len(df_unique))

Length of original df:  785741
Length of drop duplicates df: 508042
Rows Dropped: 277699